Revit 2016 API
TessellatedShapeBuilder Class
 A class that permits structured building of geometry or a mesh from a collection of connected faces. Contains all closed face sets and custom precisions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2015
Syntax
C#
public class TessellatedShapeBuilder : IDisposable
Visual Basic
Public Class TessellatedShapeBuilder _
	Implements IDisposable
Visual C++
public ref class TessellatedShapeBuilder : IDisposable
Remarks
 Creates a geometry populated with a shell or a connected solid (a solid may have inner voids) from the sets of connected faces. All faces are planar and have polyline boundaries, defined as sequences of 3d coordinates. Faces are added to the builder as a part of face sets, representing faces which share edges (e.g., outer 'surface' of a solid or inner 'surface' of solid voids). Order of faces in sets is irrelevant. Faces can only be added to the build while a face set is "open" (use OpenConnectedFaceSet(Boolean) to open a face set). Before attempting to build Revit geometry from the builder the current face set should be closed (CloseConnectedFaceSet()). The builder allows for the possibility of multiple face sets - in such cases the first set should represent the outer 'surface' of a body and all following sets represent interior voids. The builder tries to create a geometry valid in Revit despite inconsistencies or omissions in the input data.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.TessellatedShapeBuilder
See Also
TessellatedShapeBuilder Members
Autodesk.Revit.DB Namespace